FKDD_COPY_DIFF_3_2026-02-13/Reports/XYZ_АнализПокупателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>XYZ_АнализПокупателей</Name>
			<Comment>XYZ анализ покупателей</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОтчета</Name>
					<Comment>Вид отчета: обороты, остатки, остатки и обороты</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыбТипДиаграммы</Name>
					<Comment>Тип отображения диаграммы</Comment>
					<Type>
						<v8:Type>v8ui:ChartType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьДополнительныеПоляВОтдельнойКолонке</Name>
					<Comment>Выводить дополнительные группировок в отдельной колонке</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаX</Name>
					<Comment>Группа X</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаY</Name>
					<Comment>Группа Y</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаZ</Name>
					<Comment>Группа Z</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКонца</Name>
					<Comment>Дата окончания отчета</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Comment>Дата начала отчета</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяМакетаОформленияТабличногоДокумента</Name>
					<Comment>Имя макета оформления табличного документа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяРегистра</Name>
					<Comment>Имя регистра для запроса</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФормыНастроек</Name>
					<Comment>Текущее имя формы настроек</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПериодовАнализа</Name>
					<Comment>Количество периодов анализа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеУчитыватьДниБезПродаж</Name>
					<Comment>Флаг отбраковки периодов без продаж</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрыИзмеренийСтрок</Name>
					<Comment>Параметры измерений строк</Comment>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Периодичность</Name>
					<Comment>Периодичность</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПостроительОтчета</Name>
					<Comment>Объект формирования отчета</Comment>
					<Type>
						<v8:Type>cfg:ReportBuilder</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимВыводаОтчета</Name>
					<Comment>Режим отображения: табличный документ, сводная таблица, диаграмма</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.РежимыВыводаОтчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимНастройки</Name>
					<Comment>Режим настройки отчета: стандарт, эксперт</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.РежимыНастройкиОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сортировка</Name>
					<Comment>Порядок сортировки</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СохраненныеНастройки</Name>
					<Comment>Сохраненные настройки отчета</Comment>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьАвтоотступ</Name>
					<Comment>Использовать автоотступ</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Показатели</Name>
					<Comment>Показатели отчета</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Comment>Имя показателя</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Comment>Представление показателя</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Использование</Name>
							<Comment>Флаг использования показателя</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФорматнаяСтрока</Name>
							<Comment>Форматная строка отображения показателя</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Положение</Name>
							<Comment>Положение показателя в табличном документе</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.ПоложенияПоказателяТабличногоДокумента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШиринаКолонки</Name>
							<Comment>Ширина колонки</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Функции</Name>
					<Comment>Функции отчета</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Comment>Имя функции</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Comment>Представление функции</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Использование</Name>
							<Comment>Флаг использования функции</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИзмеренияСтроки</Name>
					<Comment>Таблица измерений строк отчета</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Использование</Name>
							<Comment>Флаг использования измерения строк</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПутьКДанным</Name>
							<Comment>Путь к данным измерения строк</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Comment>Представление измерения строк</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипИзмерения</Name>
							<Comment>Тип измерения строк</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИзмеренияКолонки</Name>
					<Comment>Таблица измерений колонок отчета</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Использование</Name>
							<Comment>Флаг использования измерения колонок</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПутьКДанным</Name>
							<Comment>Путь к данным измерения колонок</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Comment>Представление измерения колонок</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипИзмерения</Name>
							<Comment>Тип измерения колонки</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/Reports/XYZ_АнализПокупателей/Ext/ObjectModule.bsl
#Если Клиент Тогда
// Модуль отчета

////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ ОБЪЕКТА
Перем ТекстЗапроса Экспорт;                             //хранит текст запроса
Перем ПараметрыИспользованияПолейИПоказателей Экспорт;  //хранит параметры использования полей и показателей
Перем ДеревоДоступныхПолей Экспорт;                     //хранит дерево полей
Перем СтруктураСвязиСвойств Экспорт;                    //хранит структуру связи свойств
Перем ПриемникПеретаскивания Экспорт;                   //хранит перетаскиваемый объект
Перем СтруктураНеСвязанныхПоказателей Экспорт;          //хранит структуру не связанных полей
Перем ДополнительныеПоляОтчета Экспорт;                 //хранит дополнительные поля отчета
Перем ПромежуточныйТекстЗапроса;                        //хранит промежуточный текст запроса
Перем мСортировка Экспорт;                              //Возможные сортировки
Перем мПериодичность Экспорт;                           //Периодичность
Перем ТаблицаДляВывода;                                 //хранит таблицу для вывода
Перем СтруктураИтоговыхВыраженийПоказателей Экспорт;    //хранит структуру несвязанных показателей

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОПОЛНИТЕЛЬНЫХ МЕТОДОВ ОБЪЕКТА

// Стандартная процедура настройки построителя отчета 
//
// Параметры
//  ИмяМакета  – строка – название макета
//
//  ИмяМакетаПараметров  – строка – название макета параметров
//
Процедура ЗаполнитьНачальныеНастройки(ИмяМакета, ИмяМакетаПараметров="Параметры") Экспорт
	
	// Заполним структуру параметров
	СтруктураПараметрыЗаполнения = Новый Структура();
	СтруктураПараметрыЗаполнения.Вставить("ОтчетОбъект",            ЭтотОбъект);
	СтруктураПараметрыЗаполнения.Вставить("ИмяМакетаТекстаЗапроса", ИмяМакета);
	СтруктураПараметрыЗаполнения.Вставить("ИмяМакетаПараметров",    ИмяМакетаПараметров);
	отЗаполнитьНачальныеНастройки(СтруктураПараметрыЗаполнения, глПрава);
	
	ПараметрыИспользованияПолейИПоказателей["XYZГруппа"].Использование.Ресурсы["ПроцентНаценки"]		= Ложь;;
	ПараметрыИспользованияПолейИПоказателей["XYZГруппа"].Использование.Ресурсы["КоэффициентВариации"] = Ложь;

	ПараметрыИспользованияПолейИПоказателей.ОбщийИтог.Использование.Ресурсы.ПроцентНаценки 		= Ложь;
	ПараметрыИспользованияПолейИПоказателей.ОбщийИтог.Использование.Ресурсы.КоэффициентВариации = Ложь;
	
КонецПроцедуры	//	ЗаполнитьНачальныеНастройки()

// получить таблицу источника данных
//
// Параметры
//  ТекПостроитель  – ПостроительОтчета - текущий построитель
//  ТаблицаВывода - таблица  
//  СтруктураКолонок - структура 
//
// Возвращаемое значение:
//  ТаблицаВывода
// 
Функция ПолучитьТаблицуИсточникаДанных(ТекПостроитель, ТаблицаВывода, СтруктураКолонок) Экспорт
	
	ОписаниеТиповЧисло = Новый ОписаниеТипов("Число", , ,Новый КвалификаторыЧисла(15,3));
	
	ИзмененияВПостроителе = Ложь;
	Если ТекПостроитель.ИзмеренияСтроки.Найти("XYZГруппа") = Неопределено Тогда
		СтрокаДерева	= ДеревоДоступныхПолей.Строки.Найти("XYZГруппа", "ПутьКДанным");
		НоваяСтрока		= ТекПостроитель.ИзмеренияСтроки.Вставить(СтрокаДерева.ПутьКДанным, СтрокаДерева.Имя, ТипИзмеренияПостроителяОтчета.Элементы, , , 0);
		НоваяСтрока.Представление = СтрокаДерева.Представление;
		ИзмененияВПостроителе = Истина;
	КонецЕсли;
	
	Если ИзмененияВПостроителе Тогда
		ТекПостроитель.Выполнить();
	КонецЕсли;
	
	ТекПостроитель.ИзмеренияСтроки.Добавить("Период"+Периодичность);
	ТекПостроитель.Выполнить();
	
	Выборка = ТекПостроитель.Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Покупатель", "Все");
	
	НакопленнаяСумма = 0;
	ПорогХ = ГруппаX;
	ПорогУ = ГруппаY;
	
	СтруктураВычисляемыхПоказателей = Новый Структура ("КоэффициентВариации, Доля");
	ОписаниеТиповЧисло = Новый ОписаниеТипов("Число", , ,Новый КвалификаторыЧисла(15,2));
	СтруктураНеобходимыхПоказателей = Новый Структура ("КоэффициентВариации, СебестоимостьУпр, СуммаНаценкиУпр");
	Для Каждого ТекНужныйПоказатель Из СтруктураНеобходимыхПоказателей Цикл
		Если ТаблицаВывода.Колонки.Найти(ТекНужныйПоказатель.Ключ) = Неопределено Тогда
			ТаблицаВывода.Колонки.Добавить(ТекНужныйПоказатель.Ключ, ОписаниеТиповЧисло);
		КонецЕсли;
	КонецЦикла;
	
	ДетализацияВыборкиПериода = ?(НеУчитыватьДниБезПродаж, "", "Все");
	Выборка.Сбросить();
	Пока Выборка.Следующий() Цикл
		
		ТекСуммаПараметра = Выборка[Сортировка];
		
		Отклонение = 0;
		ВыборкаПоПериоду = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Период"+Периодичность, ДетализацияВыборкиПериода);
		КоличествоВВыборке = ВыборкаПоПериоду.Количество();
		
		Среднее = ТекСуммаПараметра/КоличествоВВыборке;
		Пока ВыборкаПоПериоду.Следующий() Цикл
			Отклонение = Отклонение + Pow(?(ВыборкаПоПериоду[Сортировка]=Null, -Среднее, (ВыборкаПоПериоду[Сортировка] - Среднее)), 2);
		КонецЦикла;
		
		Если Среднее = 0 Тогда
			КоэффициентВариации = 0;
		Иначе
			КоэффициентВариации = ?(КоличествоВВыборке = 0,0,(SQRT(Отклонение/КоличествоВВыборке)/Среднее)*100);
		КонецЕсли;
		
		КоэффициентВариацииПоМодулю = обМод(КоэффициентВариации);
		
		Если КоэффициентВариацииПоМодулю <= ПорогХ Тогда
			ТекXYZГруппа = "Группа X";
		ИначеЕсли КоэффициентВариацииПоМодулю <= ПорогУ Тогда
			ТекXYZГруппа = "Группа Y";
		Иначе
			ТекXYZГруппа = "Группа Z";
		КонецЕсли;
		
		ВыборкаДетали = Выборка.Выбрать(ОбходРезультатаЗапроса.Прямой);
		Пока ВыборкаДетали.Следующий() Цикл
			Если НЕ ВыборкаДетали.Группировка() = "" Тогда
				Продолжить;
			КонецЕсли;
			НоваяСтрока = ТаблицаВывода.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетали);
			НоваяСтрока.XYZГруппа           = ТекXYZГруппа;
			НоваяСтрока.КоэффициентВариации = КоэффициентВариации;
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ТаблицаВывода;
	
КонецФункции // ПолучитьТаблицуИсточникаДанных()

// формирует отчет в виде табличного документа и возвращает его в качестве результата
//
// Параметры
//  ДокументРезультат – ТабличныйДокумент или ПолеТабличногоДокумента – передает ссылку на табличный документ 
//						или поле табличного документа
//
// Возвращаемое значение:
//  отчет в виде табличного документа 
//
Функция СформироватьТабличныйДокумент(ДокументРезультат=Неопределено) Экспорт
	
	Если НЕ отКорректностьЗаполнения(ЭтотОбъект) Тогда	
		Возврат ДокументРезультат;	
	КонецЕсли;
	
	Если (ГруппаX > ГруппаY) ИЛИ  (ГруппаY > ГруппаZ) Тогда
		Предупреждение("Параметры XYZ должны быть упорядочены по возрастанию!");
		Возврат ДокументРезультат;
	КонецЕсли;
	
	Если СокрЛП(Сортировка) = "" Тогда
		Предупреждение("Не задана сортировка данных отчета!");
		Возврат ДокументРезультат;
	КонецЕсли;

	ОсновныеДействияПередФормированием();
	
	Если ИзмеренияСтроки.Найти("XYZГруппа") = Неопределено Тогда
		СтрокаДерева	= ДеревоДоступныхПолей.Строки.Найти("XYZГруппа", "ПутьКДанным");
		НоваяСтрока		= ИзмеренияСтроки.Вставить(СтрокаДерева.ПутьКДанным, СтрокаДерева.Имя, ТипИзмеренияПостроителяОтчета.Элементы, , , 0);
		НоваяСтрока.Представление = СтрокаДерева.Представление;
	КонецЕсли;
	
	Если ИзмеренияСтроки.Найти("Покупатель") = Неопределено Тогда
		СтрокаДерева = ДеревоДоступныхПолей.Строки.Найти("Покупатель", "ПутьКДанным");
		НоваяСтрока = ИзмеренияСтроки.Добавить();

		НоваяСтрока.ПутьКДанным		= СтрокаДерева.ПутьКДанным;
		НоваяСтрока.ТипИзмерения	= ТипИзмеренияПостроителяОтчета.Элементы;
		НоваяСтрока.Представление	= СтрокаДерева.Представление;
	КонецЕсли;
	
	Результат = отСформироватьТабличныйДокумент(ЭтотОбъект, ДокументРезультат, 1);
	Результат.ТолькоПросмотр = обПраво("ЗащитаПечатныхФорм", глПрава);
	ОсновныеДействияПослеФормирования();

	Возврат Результат;
КонецФункции // СформироватьТабличныйДокумент()

// формирует диаграмму и возвращает её 
//
// Параметры
//  ПолеДиаграммы – передает ссылку на поле диаграммы
//  СтруктураПараметров - передает структуру параметров диаграммы
//
// Возвращаемое значение:
//  поле диаграммы 
//
Функция СформироватьДиаграмму(ПолеДиаграммы=Неопределено, СтруктураПараметров=Неопределено) Экспорт
	
	ОсновныеДействияПередФормированием();
	
	СтруктураПараметров.Серии = "XYZГруппа";
	СтруктураПараметров.Точки = "Покупатель";

	отСформироватьДиаграмму(ЭтотОбъект, ПолеДиаграммы, СтруктураПараметров, 1);
	ОсновныеДействияПослеФормирования();

	Возврат ПолеДиаграммы;
	
КонецФункции // СформироватьДиаграмму()

// Функция возвращает структуру форматирования полей
//
// Без параметров
//  
// Возвращаемое значение:
//  СтруктураФорматаПолей - структура
//
Функция СтруктураФорматированияПолей() Экспорт

	СтруктураФорматаПолей = Новый Структура;
	отСтруктураФорматированияПолей(ЭтотОбъект, СтруктураФорматаПолей);

	// Если необходимо, добавим другие или переустановим строки форматирования полей
	
	Возврат СтруктураФорматаПолей;

КонецФункции	//	СтруктураФорматированияПолей()

// возвращает список сортировки
// 
// Без параметров
//                 
// Возвращаемое значение:
//  СписокСортировки - список
// 
Функция СтруктураСортировки() Экспорт
		
	Если СокрЛП(Сортировка) = "" Тогда
		СписокСортировки = Неопределено;
	Иначе
		СписокСортировки = Новый СписокЗначений();
		СписокСортировки.Добавить(НаправлениеСортировки.Возр, "XYZГруппа");
		СписокСортировки.Добавить(НаправлениеСортировки.Возр, "КоэффициентВариации");
	КонецЕсли;
	Возврат СписокСортировки;
	
КонецФункции // СтруктураФорматированияПолей()

// Производит основные действия перед формированием
//
// Без параметров
//
Процедура ОсновныеДействияПередФормированием()
	
	ПромежуточныйТекстЗапроса = ТекстЗапроса;
	
	Показатель = Показатели.Найти(Сортировка);
	Показатель.Использование = Истина;

	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//ПЕРИОДИЧНОСТЬ", ", Период"+Периодичность+" ПЕРИОДАМИ ("+Периодичность+", &ДатаНач, &ДатаКон)");

КонецПроцедуры // ОсновныеДействияПередФормированием()

// Производит основные действия после формирования
//
// Без параметров
//
Процедура ОсновныеДействияПослеФормирования()
		
	ТекстЗапроса = ПромежуточныйТекстЗапроса;
		
КонецПроцедуры // ОсновныеДействияПослеФормирования()

//////////////////////////////////////////////////////////////////////////////////
//// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ

мСортировка = Новый СписокЗначений;
мСортировка.Добавить("СуммаРегл", "Сумма продаж (Регл.)");
мСортировка.Добавить("СуммаУпр", "Сумма продаж (Упр.)");
мСортировка.Добавить("Количество", "Количество (в базовых ед.)");
мСортировка.Добавить("СуммаНаценкиРегл", "Сумма наценки (Регл.)");
мСортировка.Добавить("СуммаНаценкиУпр", "Сумма наценки (Упр.)");
мСортировка.Добавить("ПроцентНаценки", "Процент наценки");

мПериодичность = Новый СписокЗначений;
мПериодичность.Добавить("День", "День");
мПериодичность.Добавить("Неделя", "Неделя");
мПериодичность.Добавить("Месяц", "Месяц");

ГруппаX = 10;
ГруппаY = 25;
ГруппаZ = 65;

//установим сортировку
Сортировка = мСортировка[0].Значение;
Периодичность = мПериодичность[0].Значение;

ИмяРегистра = "Продажи";
отОтчетПриИнициализацииОбъекта(ЭтотОбъект);
СтруктураНеСвязанныхПоказателей = Новый Структура();
СтруктураИтоговыхВыраженийПоказателей = Новый Структура();
#КонецЕсли
